ERP.belugaerp/src/Catalogs/ЛицензииПоставщиковАлкогольнойПродукции/ЛицензииПоставщиковАлкогольнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЛицензииПоставщиковАлкогольнойПродукции</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>бг_ВидЛицензируемойДеятельности</name>
    <type>
      <types>CatalogRef.бг_ВидыЛицензируемойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаПрекращенияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЗаменяемаяЛицензия</name>
    <type>
      <types>CatalogRef.ЛицензииПоставщиковАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерРАР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПриостановленаСДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Регион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_СлабоалкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипЛицензии</name>
    <type>
      <types>EnumRef.бг_ТипыЛицензийПоставщиковАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Хорека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЛицензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>бг_ВидыАлкогольнойПродукции</name>
    <attributes>
      <name>ВидАлкогольнойПродукции</name>
      <type>
        <types>CatalogRef.ВидыАлкогольнойПродукции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_ПунктыНазначения</name>
    <attributes>
      <name>ВладелецПунктаНазначения</name>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>СлабоалкогольнаяПродукция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/ЛицензииПоставщиковАлкогольнойПродукции/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает действующую лицензию на дату запроса
//
// Параметры:
//  Владелец - СправочникСсылка.Организация, СправочникСсылка.Контрагент
//  Дата - Дата, на которую проверяется наличие лицензии
//
//Возвращаемое значение:
//	ТипЛицензии - Перечисление.бг_ТипыЛицензийПоставщиковАлкогольнойПродукции 
//
Функция бг_ТипЛицензииОрганизации(Владелец, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛицензииПоставщиковАлкогольнойПродукции.бг_ТипЛицензии КАК ТипЛицензии
	|ИЗ
	|	Справочник.ЛицензииПоставщиковАлкогольнойПродукции КАК ЛицензииПоставщиковАлкогольнойПродукции
	|ГДЕ
	|	ЛицензииПоставщиковАлкогольнойПродукции.Владелец = &Владелец
	|	И ВЫБОР
	|			КОГДА ЛицензииПоставщиковАлкогольнойПродукции.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛицензииПоставщиковАлкогольнойПродукции.ДатаНачала <= &Дата
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ЛицензииПоставщиковАлкогольнойПродукции.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛицензииПоставщиковАлкогольнойПродукции.ДатаОкончания > &Дата
	|		КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].ТипЛицензии;
	КонецЕсли;	
	
КонецФункции

&Вместо("ПолучитьБлокируемыеРеквизитыОбъекта")
Функция бг_ПолучитьБлокируемыеРеквизитыОбъекта()

	Результат = Новый Массив;
//#Вставка
	Результат.Добавить("бг_ВидыАлкогольнойПродукции");
	Результат.Добавить("бг_ВидЛицензируемойДеятельности");
	Результат.Добавить("бг_ДатаВыдачи");
	Результат.Добавить("бг_ДатаПрекращенияДействия");
	Результат.Добавить("бг_ЗаменяемаяЛицензия");
	Результат.Добавить("бг_Номер");
	Результат.Добавить("бг_НомерРАР");
	Результат.Добавить("бг_ПриостановленаСДаты");
	Результат.Добавить("бг_ПунктыНазначения");
	Результат.Добавить("бг_Регион");
	Результат.Добавить("бг_Серия");
	Результат.Добавить("бг_СлабоалкогольнаяПродукция");
	Результат.Добавить("бг_ТипЛицензии");
	Результат.Добавить("бг_Хорека");
//#КонецВставки
	Результат.Добавить("Владелец");
	Результат.Добавить("ВидЛицензии");
//#Вставка
	Результат.Добавить("ДатаНачала");
	Результат.Добавить("ДатаОкончания");
	Результат.Добавить("КемВыдана");
//#КонецВставки

	Возврат Результат;

КонецФункции

#КонецОбласти
